# Задание №1
# Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные.

data = ['Буся', False, 5141.4, -98989]
for item in data:
    print(item, ' | ', type(item))
